app/controllers/movies_controller.rb

  def index

    redirect = false
    # get sort order from the url-parameter
    order_field = params[:order]
    if order_field == nil
      # if no order set, get the last order from the session
      order_field = session[:order]
      # if there is no session-data, that make a default-value ('id')
      order_field = 'id' if order_field == nil
      params[:order] = order_field
      redirect = true
    else
      # store order into the session for the next time
      session[:order] = order_field
    end

    # ratings = { "P"=>1, "G"=1}
    # get only the keys of the params
    @checked_ratings = params[:ratings].keys if (params[:ratings] != nil)
    if @checked_ratings == nil
      # if not set via URL, than get stored ratings
      @checked_ratings = session[:ratings]
      # all ratingss on, if there is no rating stored
      @checked_ratings = Movie.valid_ratings if @checked_ratings == nil
      # rebuild the ratings-hash for the redirect-params
      para = {}
      @checked_ratings.each do |r|
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (NULL) ORDER BY release_date

    end

    # query to database
    @movies = Movie.where(rating: @checked_ratings).all(:order => order_field)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'G' AND "movies"."order" = 'release_date'